app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save