app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6kBGsqKLxtn5TQtEzesBMD7TGAX1IOG7KPDtVGJw29FqZprAKg6cNmqw9pmHrLKTT04/fbleVN+1T/ZPKgUZEA=="], ["updated_at", "2020-04-07 18:00:17.314533"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64)
        self.save!